app/Controllers/Home.php

    public function registration()
    {
        $subjectsModel = new SubjectModel();
        $subjects = $subjectsModel->findAll();
---
SELECT *
FROM `subjects`

    public function authentication()
    {

        $session = \Config\Services::session();

        $teacherModel = new TeacherModel();

        $login = $this->request->getVar('login');
        $pass = $this->request->getVar('pass');

        $user = $teacherModel->where('login', $login)->first();
---
SELECT *
FROM `teachers`
WHERE `login` = 'jose'
 LIMIT 1