app/Controllers/Mensagens.php

    public function novamensagem()
    {
        $teacherModel = new TeacherModel();
        $teachers = $teacherModel->findAll();
---
SELECT *
FROM `teachers`

    public function listar()
    {

        $session = session();

        $loginData = $session->get();

        if (!isset($loginData['isLogged'])) {
            return redirect()->to('/');
        } else {
            $userId = $loginData['id'];
        }

        $mensagensModel = new MensagensModel();
        $mensagens = $mensagensModel->where('receiver', $userId)->findAll();

        $alunosModel = new StudentModel();
        $alunos = $alunosModel->findAll();

        $teacherModel = new TeacherModel();
        $teachers = $teacherModel->findAll();
---
SELECT *
FROM `students`
SELECT *
FROM `teachers`